<?php
/**
	Родит.Класс для всех Моделей. Содержит public $db в которой находится($pdo. эта $pdo из libs/db_connect.php) соедин. с DB
	При этом каждый раз,когда создается экземпляр этого Класса(Model), а этот класс наследуют все остальные Models проекта,-
    - соединение с DB доступно каждой следующей Модели(как например в случае с Моделью UserModel.php)
*/
class Model { 

	 public $db;

	 public function __construct() {
	 	global $pdo; //делаем $pdo глобальной,чтобы была доступна отовсюду(глоб.область видимости)
	 	$this->db = $pdo; 
	 }

}  //__/class Model